{
  "header": {
    "title": "ADEx Flow App",
    "exit" : "Exit"
  },
  "introduction": {
    "title": "Introduction",
    "content": "This app will help manage Global Fund ADEx Metadata. The Global Fund may periodically release new versions of the ADEx metadata package. ADEx administrators can use this app to facilitate upgrading existing ADEx metadata packages to the latest version. Using this app will not affect any existing data or metadata, as it is designed to only work with ADEx metadata. This app can also be used to export locally configured ADEx exchange indicators and data exchange configuration to a JSON file which you can then import into another DHIS2 instance.",
    "metadata-upgrade-available" : "A new version of the ADEx metadata package is available. Please visit the ADEX Metadata GitHub repository to download the latest version."
  },
  "download-package": {
    "title": "Download the latest ADEx metadata package",
    "content": "Go to GitHub via this link <a href=\"https://github.com/dhis2/gf-adex-metadata/blob/main/exchange_indicators\" target=\"blank\"> and download the latest version</a> of the ADEx metadata package. Save this file to a local computer."},
  "upload-to-datastore": {
    "title": "Upload the ADEx reference metadata to the DHIS2 datastore.",
    "content": "Select the file downloaded from the previous step to upload and click \"Upload ADEx package\". This will store a copy of the ADEx reference metadata package in the local datastore.  This step is required for a new server ADEx setup."},
    "upload-btn": {
      "choose": "Choose file",
      "no-file-chosen": "No file chosen",
      "upload": "Upload ADEx package"
    },
    "import-local" : {
      "title": "Import ADEx metadata",
      "content": "Once the previous steps are completed, click the \"Import ADEx Metadata\" button below. This will import the ADEx metadata into the DHIS2 instance. This process may take a few minutes to complete. Once the process completes, a summary will display below."
    },
    "update-local" : {
      "title": "Update ADEx metadata",
      "content": "Once the previous steps are completed, click the \"Update ADEx Metadata\" button below. During this process, your local ADEx indicators will be upgraded. Your existing numerator definitions will be preserved. This process may take a few minutes to complete. Once the process completes, a summary will display below."
    },
    "update-metadata-btn": "Update ADEx Metadata",
    "json-upload-success" : "ADEx metadata uploaded successfully",
    "json-upload-error" : "ADEx metadata upload failed",
    "json-invalid": "The JSON file you uploaded is invalid. Please check the file and try again.",
    "upgrade-status-report": "Upgrade Status Report",
    "object-type": "Object Type",
    "created": "Created",
    "updated" : "Updated",
    "deleted" : "Deleted",
    "ignored" : "Ignored",
    "total": "Total",
    "unknown-ADEx-indicators": "Unknown ADEx Indicators",
    "status"  : "Status",
    "status-code" : "Status Code",
    "loading" : "Loading...please wait.",
    "backup-config":    {
      "title": "Backup local ADEx indicators",
      "content": "Before proceeding, please backup your local ADEx indicators. This will ensure a copy exists in the event something goes wrong during the update process. Click the \"Backup local ADEX indicators\" button below to proceed.",
      "backup-btn": "Backup local ADEx indicators"
    },
    "no-remote-metadata" : "No ADEx reference metadata package found in the datastore. Please upload the ADEx reference metadata package to the datastore and try again",
    "no-local-ADEx-indicators": "No ADEx configuration found. Go back to start by importing the ADEx reference metadata.",
    "upgrade-error": "Error upgrading existing ADEx metadata. Please try again.",
    "export-local-config": {
      "title": "Export ADEx configuration",
      "content": "When it is time to migrate your configuration to production or another development instance, you can export your local configuration with the button below. Indicators, indicator groups and other ADEx metadata components will be exported to a JSON file. This file can then be imported into another DHIS2 instance. Click the \"Export ADEx configuration\" button below to proceed.",
      "export-local-config" : "Export ADEx configuration",
      "export-config-btn": "Export ADEx configuration",
      "configured-only": "Include only configured indicators",
      "btn-export-exchange" : "Export exchange",
      "select-destination" : "Select a destination server:",
      "token" : "Authentication token (optional):",
      "export-options-content" : "You can select one of the ADEx exchange configurations to export. The selected configuration will be exported to a JSON file which can be imported into another DHIS2 instance. You can optionally specify an authentication token to be used when performing the data exchange. Select a destination server and click the \"Export exchange\" button below to proceed."
    },
    "import-package": {
      "title": "Import ADEx metadata package",
      "content": "Once the ADEx reference metadata has been uploaded into the DHIS2 datastore, the ADEx metadata package can be imported into the destination DHIS2 instance. Click the \"Import package\" button below to proceed. This will import the ADEx reference metadata from the DHIS2 datastore into the destination DHIS2 instance.",
      "import-btn": "Import ADEx package",
      "existing-package-warning": "An ADEx metadata package already exisits. Importing the package will overwrite your existing ADEx metadata. Please use the 'Update' process instead."
    },
    "validation-report" : {
      "title": "ADEx Validation Report",
      "run-validation-btn": "Run Validation",
      "download-summary-btn": "Download Summary (CSV)",
      "download-report-btn": "Download Report (PDF)"
    },
    "update-impl-type" : {
      "title": "Update Implementation Type",
      "content": "Select the implementation type you would like to update to. All GFADEX indicators will be updated to this implemeter type. Click the \"Update Implementation Type\" button below to proceed.",
      "update-impl-type-btn": "Update Implementation Type",
      "update": "Update",
      "impl-type": "Implementation Type",
      "impl-type-required": "Implementation Type is required",
      "impl-type-updated": "Implementation Type updated successfully",
      "impl-type-update-error": "Error updating Implementation Type. Please try again."
    }
}
