{
  "header": {
    "title": "Application ADEx Flow",
    "exit" : "Quitter"
  },
  "introduction": {
    "title": "Introduction",
    "content": "Cette application permet de gérer les métadonnées ADEx du Fonds mondial. Le Fonds mondial peut périodiquement publier de nouvelles versions du package de métadonnées ADEx. Les administrateurs ADEx peuvent utiliser cette application pour faciliter la mise à niveau des packages de métadonnées ADEx existants vers la dernière version. L'utilisation de cette application n'affectera pas les données ou les métadonnées existantes, car elle est conçue pour fonctionner uniquement avec les métadonnées ADEx. Cette application peut également être utilisée pour exporter les indicateurs d'échange ADEx configurés localement et la configuration d'échange de données vers un fichier JSON que vous pouvez ensuite importer dans une autre instance DHIS2."
  },
  "download-package": {
    "title": "Télécharger le dernier package de métadonnées ADEx",
    "content": "Rendez-vous sur GitHub via ce lien <a href=\"https://github.com/dhis2/gf-adex-metadata/blob/main/exchange_indicators\" target=\"blank\"> et téléchargez la dernière version</a> du package de métadonnées ADEx. Enregistrez ce fichier sur un ordinateur local."
  },
  "upload-to-datastore": {
    "title": "Importer les métadonnées de référence ADEx dans le datastore DHIS2.",
    "content": "Sélectionnez le fichier téléchargé à l'étape précédente pour l'importer, puis cliquez sur \"Importer le package ADEx\". Cela stockera une copie du package de métadonnées de référence ADEx dans le datastore local. Cette étape est nécessaire pour une nouvelle configuration ADEx du serveur."
  },
  "upload-btn": {
    "choose": "Choisir un fichier",
    "no-file-chosen": "Aucun fichier sélectionné",
    "upload": "Importer le package ADEx"
  },
  "import-local" : {
    "title": "Importer les métadonnées ADEx",
    "content": "Une fois les étapes précédentes terminées, cliquez sur le bouton \"Importer les métadonnées ADEx\" ci-dessous. Cela importera les métadonnées ADEx dans l'instance DHIS2. Ce processus peut prendre quelques minutes. Une fois le processus terminé, un résumé s'affichera ci-dessous."
  },
  "update-local" : {
    "title": "Mettre à jour les métadonnées ADEx",
    "content": "Une fois les étapes précédentes terminées, cliquez sur le bouton \"Mettre à jour les métadonnées ADEx\" ci-dessous. Pendant ce processus, vos indicateurs ADEx locaux seront mis à niveau. Vos définitions de numérateur existantes seront préservées. Ce processus peut prendre quelques minutes. Une fois le processus terminé, un résumé s'affichera ci-dessous."
  },
  "update-metadata-btn": "Mettre à jour les métadonnées ADEx",
  "json-upload-success" : "Métadonnées ADEx importées avec succès",
  "json-upload-error" : "Échec de l'importation des métadonnées ADEx",
  "json-invalid": "Le fichier JSON que vous avez importé est invalide. Veuillez vérifier le fichier et réessayer.",
  "upgrade-status-report": "Rapport d'état de mise à niveau",
  "object-type": "Type d'objet",
  "created": "Créé",
  "updated" : "Mis à jour",
  "deleted" : "Supprimé",
  "ignored" : "Ignoré",
  "total": "Total",
  "unknown-ADEx-indicators": "Indicateurs ADEx inconnus",
  "status"  : "Statut",
  "status-code" : "Code de statut",
  "loading" : "Chargement... Veuillez patienter.",
  "backup-config":    {
    "title": "Sauvegarder les indicateurs ADEx locaux",
    "content": "Avant de continuer, veuillez sauvegarder vos indicateurs ADEx locaux. Cela garantira qu'une copie existe au cas où quelque chose se passerait mal lors du processus de mise à jour. Cliquez sur le bouton \"Sauvegarder les indicateurs ADEX locaux\" ci-dessous pour continuer.",
    "backup-btn": "Sauvegarder les indicateurs ADEx locaux"
  },
  "no-remote-metadata" : "Aucun package de métadonnées de référence ADEx trouvé dans le datastore. Veuillez importer le package de métadonnées de référence ADEx dans le datastore et réessayer.",
  "no-local-ADEx-indicators": "Aucune configuration ADEx trouvée. Revenez au début en important les métadonnées de référence ADEx.",
  "upgrade-error": "Erreur lors de la mise à niveau des métadonnées ADEx existantes. Veuillez réessayer.",
  "export-local-config": {
    "title": "Exporter la configuration ADEx",
    "content": "Lorsque vous devez déplacer la configuration ADEx vers une autre instance DHIS2, cliquez sur le bouton \"Exporter la configuration ADEx\" ci-dessous. Cela exportera uniquement les métadonnées ADEx configurées, ainsi que les demandes d'échange de données, vers un fichier JSON pouvant être enregistré localement. Ce fichier JSON est importé dans l'instance DHIS2 de destination. Notez que seuls les indicateurs ADEx configurés dans l'instance DHIS2 locale seront inclus !",
    "export-btn": "Exporter la configuration ADEx",
    "configured-only": "Inclure uniquement les indicateurs configurés"
  },
  "import-package": {
    "title": "Importer le package de métadonnées ADEx",
    "content": "Une fois que les métadonnées de référence ADEx ont été importées dans le datastore DHIS2, le package de métadonnées ADEx peut être importé dans l'instance DHIS2 de destination. Cliquez sur le bouton \"Importer le package\" ci-dessous pour continuer. Cela importera les métadonnées de référence ADEx du datastore DHIS2 dans l'instance DHIS2 de destination.",
    "import-btn": "Importer le package ADEx",
    "existing-package-warning": "Un package de métadonnées ADEx existe déjà. L'importation du package écrasera vos métadonnées ADEx existantes. Veuillez utiliser le processus de 'Mise à jour' à la place."
  },
  "validation-report" : {
    "title": "Rapport de validation ADEx",
    "run-validation-btn": "Lancer la validation",
    "download-summary-btn": "Télécharger le résumé (CSV)",
    "download-report-btn": "Télécharger le rapport (PDF)"
  },
  "update-impl-type" : {
    "title": "Mettre à jour le type de mise en œuvre",
    "content": "Sélectionnez le type de mise en œuvre que vous souhaitez mettre à jour. Tous les indicateurs GFADEX seront mis à jour vers ce type de mise en œuvre. Cliquez sur le bouton \"Mettre à jour le type de mise en œuvre\" ci-dessous pour continuer.",
    "update-impl-type-btn": "Mettre à jour le type de mise en œuvre",
    "update": "Mettre à jour",
    "impl-type": "Type de mise en œuvre",
    "impl-type-required": "Le type de mise en œuvre est requis",
    "impl-type-updated": "Type de mise en œuvre mis à jour avec succès",
    "impl-type-update-error": "Erreur lors de la mise à jour du type de mise en œuvre. Veuillez réessayer."
  }
}
