{
  "header": {
    "title": "Gestionnaire de paquets GF ADEX",
    "exit": "Quitter"
  },
  "introduction": {
    "title": "Introduction",
    "content": "Cette application vous aidera à mettre à jour vers la dernière version du package de métadonnées GF ADEx. Suivez les étapes ci-dessous pour mettre à niveau le package. Toutes les métadonnées liées à GF ADEX telles que les indicateurs, les groupes d'indicateurs seront mises à jour. Toutes les modifications que vous avez apportées aux définitions du numérateur seront préservées."
  },
  "download-package": {
    "title": "Téléchargez le dernier package",
    "content": "Rendez-vous sur GitHub et téléchargez <a href=\"https://github.com/dhis2/gf-adex-metadata/blob/main/exchange_indicators\" target=\"blank\">la dernière version</a> du package de métadonnées GF ADEx. Enregistrez ceci sur votre ordinateur local."
  },
  "upload-to-datastore": {
    "title": "Téléchargez une copie des métadonnées GF ADEX dans le datastore DHIS2.",
    "content": "À l'aide du fichier que vous avez téléchargé lors de l'étape précédente, choisissez le fichier à télécharger, puis cliquez sur \"Télécharger le modèle GFADEx\". Cela sauvegardera une copie des métadonnées GF ADEx dans le datastore local."
  },
  "upload-btn": {
    "choose": "Choisir un fichier",
    "no-file-chosen": "Aucun fichier choisi",
    "upload": "Télécharger le modèle GFADEx"
  },
  "update-local": {
    "title": "Mise à jour des métadonnées GFADex",
    "content": "Une fois que vous avez terminé les étapes précédentes, cliquez sur le bouton \"Mettre à jour les métadonnées GF ADEx\" ci-dessous. Cela mettra à jour les métadonnées GF ADEx dans votre instance DHIS2. Ce processus n'affectera pas vos données ou métadonnées existantes, à l'exception des métadonnées GFADEx. Ce processus prendra quelques minutes pour se terminer. Une fois le processus terminé, vous verrez un résumé du processus d'importation ci-dessous."
  },
  "update-metadata-btn": "Mettre à jour les métadonnées GF ADEx",
  "json-upload-success": "Métadonnées GF ADEX téléchargées avec succès",
  "json-upload-error": "Échec du téléchargement des métadonnées GF ADEX",
  "json-invalid": "Le fichier JSON que vous avez téléchargé est invalide. Veuillez vérifier le fichier et réessayer.",
  "upgrade-status-report": "Rapport d'état de la mise à niveau",
  "object-type": "Type d'objet",
  "created": "Créé",
  "updated": "Mis à jour",
  "deleted": "Supprimé",
  "ignored": "Ignoré",
  "total": "Total",
  "unknown-gfadex-indicators": "Indicateurs GFADEx inconnus",
  "status": "Statut",
  "status-code": "Code de statut",
  "loading": "Chargement... veuillez patienter.",
  "backup-config": {
    "title": "Sauvegardez votre configuration locale",
    "content": "Avant de continuer, veuillez sauvegarder votre configuration locale. Cela vous permettra de restaurer votre configuration locale en cas de problème lors du processus de mise à niveau ou si vous avez besoin de restaurer cette configuration sur un autre système. Cliquez sur le bouton \"Sauvegarder\" ci-dessous pour sauvegarder votre configuration locale.",
    "backup-btn": "Sauvegarder",
    "configured-only": "Sauvegarder uniquement les indicateurs configurés"
  }
}