{
  "header": {
    "title": "Aplicativo ADEx Flow",
    "exit" : "Sair"
  },
  "introduction": {
    "title": "Introdução",
    "content": "Este aplicativo ajudará a gerenciar os Metadados ADEx do Fundo Global. O Fundo Global pode lançar periodicamente novas versões do pacote de metadados ADEx. Os administradores do ADEx podem usar este aplicativo para facilitar a atualização dos pacotes de metadados ADEx existentes para a versão mais recente. O uso deste aplicativo não afetará nenhum dado ou metadados existentes, pois ele foi projetado para funcionar apenas com metadados ADEx. Este aplicativo também pode ser usado para exportar indicadores de troca de dados ADEx configurados localmente e a configuração de troca de dados para um arquivo JSON que pode ser importado para outra instância do DHIS2."
  },
  "download-package": {
    "title": "Baixe o pacote de metadados ADEx mais recente",
    "content": "Acesse o GitHub através deste link <a href=\"https://github.com/dhis2/gf-adex-metadata/blob/main/exchange_indicators\" target=\"blank\"> e baixe a versão mais recente</a> do pacote de metadados ADEx. Salve este arquivo em um computador local."
  },
  "upload-to-datastore": {
    "title": "Faça o upload dos metadados de referência ADEx para o datastore do DHIS2.",
    "content": "Selecione o arquivo baixado na etapa anterior para fazer o upload e clique em \"Fazer upload do pacote ADEx\". Isso armazenará uma cópia do pacote de metadados de referência ADEx no datastore local. Esta etapa é necessária para uma nova configuração do servidor ADEx."
  },
  "upload-btn": {
    "choose": "Escolher arquivo",
    "no-file-chosen": "Nenhum arquivo selecionado",
    "upload": "Fazer upload do pacote ADEx"
  },
  "import-local" : {
    "title": "Importar metadados ADEx",
    "content": "Após a conclusão das etapas anteriores, clique no botão \"Importar Metadados ADEx\" abaixo. Isso importará os metadados ADEx para a instância do DHIS2. Esse processo pode levar alguns minutos para ser concluído. Após a conclusão do processo, um resumo será exibido abaixo."
  },
  "update-local" : {
    "title": "Atualizar metadados ADEx",
    "content": "Após a conclusão das etapas anteriores, clique no botão \"Atualizar Metadados ADEx\" abaixo. Durante esse processo, seus indicadores ADEx locais serão atualizados. Suas definições de numerador existentes serão preservadas. Esse processo pode levar alguns minutos para ser concluído. Após a conclusão do processo, um resumo será exibido abaixo."
  },
  "update-metadata-btn": "Atualizar Metadados ADEx",
  "json-upload-success" : "Metadados ADEx enviados com sucesso",
  "json-upload-error" : "Falha no envio dos metadados ADEx",
  "json-invalid": "O arquivo JSON que você enviou é inválido. Verifique o arquivo e tente novamente.",
  "upgrade-status-report": "Relatório de Status de Atualização",
  "object-type": "Tipo de Objeto",
  "created": "Criado",
  "updated" : "Atualizado",
  "deleted" : "Excluído",
  "ignored" : "Ignorado",
  "total": "Total",
  "unknown-ADEx-indicators": "Indicadores ADEx Desconhecidos",
  "status"  : "Status",
  "status-code" : "Código de Status",
  "loading" : "Carregando... aguarde.",
  "backup-config":    {
    "title": "Fazer backup dos indicadores ADEx locais",
    "content": "Antes de prosseguir, faça backup dos seus indicadores ADEx locais. Isso garantirá que uma cópia exista caso algo dê errado durante o processo de atualização. Clique no botão \"Fazer backup dos indicadores ADEX locais\" abaixo para prosseguir.",
    "backup-btn": "Fazer backup dos indicadores ADEx locais"
  },
  "no-remote-metadata" : "Nenhum pacote de metadados de referência ADEx encontrado no datastore. Faça o upload do pacote de metadados de referência ADEx para o datastore e tente novamente",
  "no-local-ADEx-indicators": "Nenhuma configuração ADEx encontrada. Volte ao início importando os metadados de referência ADEx.",
  "upgrade-error": "Erro ao atualizar os metadados ADEx existentes. Por favor, tente novamente.",
  "export-local-config": {
    "title": "Exportar configuração ADEx",
    "content": "Quando é hora de migrar sua configuração para produção ou outra instância de desenvolvimento, você pode exportar sua configuração local com o botão abaixo. Indicadores, grupos de indicadores e outros componentes de metadados ADEx serão exportados para um arquivo JSON. Este arquivo pode então ser importado para outra instância do DHIS2. Clique no botão \"Exportar configuração ADEx\" abaixo para prosseguir.",
    "export-local-config": "Exportar configuração ADEx",
    "export-config-btn": "Exportar configuração ADEx",
    "configured-only": "Incluir apenas indicadores configurados",
    "btn-export-exchange": "Exportar troca",
    "select-destination": "Selecione um servidor de destino:",
    "token": "Token de autenticação (opcional):",
    "export-options-content": "Você pode selecionar uma das configurações de troca ADEx para exportar. A configuração selecionada será exportada para um arquivo JSON que pode ser importado para outra instância do DHIS2. Você pode opcionalmente especificar um token de autenticação a ser usado durante a realização da troca de dados. Selecione um servidor de destino e clique no botão \"Exportar troca\" abaixo para prosseguir."
  },
  "import-package": {
    "title": "Importar pacote de metadados ADEx",
    "content": "Após o upload dos metadados de referência ADEx no datastore do DHIS2, o pacote de metadados ADEx pode ser importado para a instância do DHIS2 de destino. Clique no botão \"Importar pacote\" abaixo para prosseguir. Isso importará os metadados de referência ADEx do datastore do DHIS2 para a instância do DHIS2 de destino.",
    "import-btn": "Importar pacote ADEx",
    "existing-package-warning": "Já existe um pacote de metadados ADEx. A importação do pacote substituirá seus metadados ADEx existentes. Por favor, use o processo de 'Atualização' em vez disso."
  },
  "validation-report" : {
    "title": "Relatório de Validação ADEx",
    "run-validation-btn": "Executar Validação",
    "download-summary-btn": "Baixar Resumo (CSV)",
    "download-report-btn": "Baixar Relatório (PDF)"
  },
  "update-impl-type" : {
    "title": "Atualizar Tipo de Implementação",
    "content": "Selecione o tipo de implementação que você deseja atualizar. Todos os indicadores GFADEX serão atualizados para este tipo de implementação. Clique no botão \"Atualizar Tipo de Implementação\" abaixo para prosseguir.",
    "update-impl-type-btn": "Atualizar Tipo de Implementação",
    "update": "Atualizar",
    "impl-type": "Tipo de Implementação",
    "impl-type-required": "Tipo de Implementação é obrigatório",
    "impl-type-updated": "Tipo de Implementação atualizado com sucesso",
    "impl-type-update-error": "Erro ao atualizar o Tipo de Implementação. Por favor, tente novamente."
  }
}
