{
  "header": {
    "title": "GF ADEX Pakethanterare",
    "exit" : "Avsluta"
  },
  "introduction": {
    "title": "Introduktion",
    "content": "Denna app hjälper dig att uppdatera till den senaste versionen av GF ADEx-metadatapaketet. Följ stegen nedan för att uppgradera paketet. All GF ADEX-relaterad metadata, såsom indikatorer och indikatorgrupper, kommer att uppdateras. Eventuella ändringar som du har gjort i täljaredefinitionerna kommer att bevaras."
  },
  "download-package": {
    "title": "Ladda ner det senaste paketet",
    "content": "Gå till GitHub och ladda ner <a href=\"https://github.com/dhis2/gf-adex-metadata/blob/main/exchange_indicators\" target=\"blank\">den senaste versionen</a> av GF ADEx-metadatapaketet. Spara detta på din lokala dator."
  },
  "upload-to-datastore": {
    "title": "Ladda upp en kopia av GF ADEX-metadata till DHIS2-datastoren.",
    "content": "Använd filen som du laddade ner från föregående steg, välj filen för att ladda upp den och klicka sedan på \"Ladda upp GFADEx-mall\". Detta kommer att spara en kopia av GF ADEx-metadata i den lokala datastoren."
  },
  "upload-btn": {
    "choose": "Välj fil",
    "no-file-chosen": "Ingen fil vald",
    "upload": "Ladda upp GFADEx-mall"
  },
  "update-local" : {
    "title": "Uppdatera GFADex-metadata",
    "content": "När du har slutfört de tidigare stegen, klicka på knappen \"Uppdatera GF ADEx Metadata\" nedan. Detta kommer att uppdatera GF ADEx-metadata i din DHIS2-instans. Denna process påverkar inte några av dina befintliga data eller metadata förutom GFADEx-metadata. Denna process tar några minuter att slutföra. När processen är klar kommer du att se en sammanfattning av importprocessen nedan."
  },
  "update-metadata-btn": "Uppdatera GF ADEx Metadata",
  "json-upload-success" : "GF ADEX-metadata uppladdat framgångsrikt",
  "json-upload-error" : "Misslyckades att ladda upp GF ADEX-metadata",
  "json-invalid": "Den JSON-fil du laddade upp är ogiltig. Kontrollera filen och försök igen.",
  "upgrade-status-report": "Uppgraderingsstatusrapport",
  "object-type": "Objekttyp",
  "created": "Skapad",
  "updated" : "Uppdaterad",
  "deleted" : "Raderad",
  "ignored" : "Ignorerad",
  "total": "Totalt",
  "unknown-gfadex-indicators": "Okända GFADEx-indikatorer",
  "status"  : "Status",
  "status-code" : "Statuskod",
  "loading" : "Laddar... var god vänta.",
  "backup-config":    {
    "title": "Säkerhetskopiera din lokala konfiguration",
    "content": "Innan du fortsätter, var god säkerhetskopiera din lokala konfiguration. Detta gör att du kan återställa din lokala konfiguration om något går fel under uppgraderingsprocessen eller om du behöver återställa denna konfiguration på en annan system. Klicka på knappen \"Säkerhetskopiera\" nedan för att säkerhetskopiera din lokala konfiguration.",
    "backup-btn": "Säkerhetskopiera",
    "configured-only" : "Säkerhetskopiera endast konfigurerade indikatorer"
  }
}
